questions = [
    {
        'question': '''Передаются сообщения, содержащие только 7 букв: А, Б, Г, И, М, Р, Я. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: А — 010, Б — 011, Г — 100. Какое наименьшее количество двоичных знаков потребуется для кодирования слова МАГИЯ?''',
        'options': ['12', '13', '14'],
        'correct_option_id': 2
    },
    {
        'question': '''Передаются сообщения, содержащие только 7 букв: А, Б, Г, И, М, Р, Я. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: А — 010, Б — 00, Г — 101. Какое наименьшее количество двоичных знаков потребуется для кодирования слова МАГИЯ?''',
        'options': ['14', '15', '16'],
        'correct_option_id': 1
    },
    {
        'question': '''Передаются сообщения, содержащие только 7 букв: А, Б, И, К, Л, О, С. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: А — 001, И — 01, С — 10. Какое наименьшее количество двоичных знаков потребуется для кодирования слова КОЛОБОК?''',
        'options': ['21', '22', '23'],
        'correct_option_id': 2
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, Б, Г, И, Н, Р, Т. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: Г — 110, И — 01, Т — 10. Какое наименьшее количество двоичных знаков потребуется для кодирования слова БАРАБАН?''',
        'options': ['23', '24', '25'],
        'correct_option_id': 0
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: Б — 00, К — 010, Л — 111. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: А — 010, Б — 011, Г — 100. Какое наименьшее количество двоичных знаков потребуется для кодирования слова АБСЦИССА?''',
        'options': ['20', '21', '22'],
        'correct_option_id': 2
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, Б, В, Д, Е, И, Н. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: А — 110, Б — 01, И — 000. Какое наименьшее количество двоичных знаков потребуется для кодирования слова ВВЕДЕНИЕ?''',
        'options': ['23', '24', '25'],
        'correct_option_id': 0
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, Б, В, Г, Й, К, Л. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: Б — 00, Г — 010, К — 101. Какое наименьшее количество двоичных знаков потребуется для кодирования слова БАЛАЛАЙКА?''',
        'options': ['22', '23', '24'],
        'correct_option_id': 1
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, Б, В, Д, О, Р, Т. Для передачи используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: Б — 01, Д — 001, Р — 100. Какое наименьшее количество двоичных знаков потребуется для кодирования слова ВОДОВОРОТ?''',
        'options': ['22', '23', '24'],
        'correct_option_id': 1
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, Б, В, К, Р, Т. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова: Б – 010, Т – 011. Какое наименьшее количество двоичных знаков потребуется для кодирования слова КАТАРАКТА?''',
        'options': ['19', '20', '21'],
        'correct_option_id': 1
    },
    {
        'question': '''Передаются сообщения, содержащие только семь букв: А, В, Е, З, И, Н, О, Р. Используется двоичный код, удовлетворяющий условию Фано. Кодовые слова для некоторых букв известны: А — 101, В — 010, И — 00. Какое наименьшее количество двоичных знаков потребуется для кодирования слова НЕВЕЗЕНИЕ?''',
        'options': ['23', '24', '25'],
        'correct_option_id': 0
    }
]